Revit 2027 API
DirectShapeTypeOptions.IsValid Method
 Determines whether a DirectShapeTypeOptions is internally consistent (valid).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
Remarks
 This is currently a placeholder and always returns true. Will be made public_api and a validator when it does something useful.
See Also
Reference
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace